#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>

/*
 재귀패턴
 (n/3) * (n/3) 정사각형 크기의 패턴
 x==1 & y==1 빈칸
 (1,1)(1,4)(1,7)(1,10) --
 (1,1)(4,1)(7,1)(10,1) --
 3씩 증가하고
 (x%3)==1 && (y%3)==1 빈칸
 
 (3,3)(4,3)(5,3)
 (3,4)(4,4)(5,4)
 (3,5)(4,5)(5,5)
 
 (12,3)(13,3)(14,3)
 (12,4)(13,4)(14,4)
 (12,5)(13,5)(14,5)
 
 (21,3)(22,3)(23,3)
 (21,4)(22,4)(23,4)
 (21,5)(22,5)(23,5)
 
 */
//0,0,3, 0,0,1 *
//0,1,3 0,1,1 *
//0,2,3 0,2,1 *
//1,0,3 1,0,1 *
//1,1,3 1,1,1 " "
//1,2,3 1,2,1 *
//3,3,9 3,3,3 " "
//3,4,9 3,4,3 " "
//3,6,9 3,6,3 


void star(int x, int y, int num){
    if ((x/num)%3==1 && (y/num)%3==1){
        printf(" ");
    }
    else {
        if (num/3==0) printf("*");
        else star(x,y,num/3);
    }
}

int main(void){
    int x,y,num=0;
    scanf("%d",&num);
    
    for (x=0; x<num; x++){
        for (y=0; y<num; y++){
            star(x,y,num);
        }
        printf("\n");
    }
    return 0;
}
